DataProcessors/ОбработкаВходящихEMailЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаВходящихEMailЗаказов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонфигурацияOutlook</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДоговорыАварды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыАварды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАварда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/EMailЗаказ_ПоляExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>EMailЗаказ_ПоляExcel</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеWeb</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаВходящихEMailЗаказов/Ext/ObjectModule.bsl
Функция ПолучитьИДДоговораСПокупателем(Договор)

	Если ЗначениеЗаполнено(Договор) И Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем И Не Договор.ПометкаУдаления Тогда
		Возврат СокрЛП(Договор.КодМДМ);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыАварды.ДоговорКонтрагента,
		|	ДоговорыАварды.КодАварда
		|ИЗ
		|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
		|ГДЕ
		|	ДоговорыАварды.ДоговорКонтрагента = &Договор
		|	И ДоговорыАварды.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	И ДоговорыАварды.ДоговорКонтрагента.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыАварды.КодАварда <> """""; 	
		
		Запрос.УстановитьПараметр("Договор", Договор); 	
		Выборка = Запрос.Выполнить().Выбрать();  	
		
		Если Выборка.Следующий() Тогда
			Возврат СокрЛП(Выборка.КодАварда);
		Иначе
			Возврат "";
		КонецЕсли;
		
	КонецЕсли;		

КонецФункции

Процедура СформироватьСтруктуру(Шапка,Строки)
	
	Шапка.Очистить();
	Шапка.Вставить("Addres", "");
	Шапка.Вставить("AddresFakt", "");
	Шапка.Вставить("AddresFaktID", "");
	Шапка.Вставить("Comment", "");
	Шапка.Вставить("DogovorID", "");
	Шапка.Вставить("FirmID", "");
	Шапка.Вставить("KlientID", "");
	Шапка.Вставить("FilialID", "");
	Шапка.Вставить("TipDost", "");
	Шапка.Вставить("ValutaID", "");
	Шапка.Вставить("OrderID", "");
	Шапка.Вставить("Name", "");
	Шапка.Вставить("INN", "");
	Шапка.Вставить("KPP", "");
	Шапка.Вставить("SkladID", "");
	Шапка.Вставить("PaymentType", "");
	Шапка.Вставить("ИдентификаторСообщения", "");
	Шапка.Вставить("Контрагент",Неопределено);
	Шапка.Вставить("ФилиалКонтрагента",Неопределено);
	Шапка.Вставить("Dostavka", ""); 
	
	Строки.Колонки.Очистить();
	Строки.Колонки.Добавить("Articul");
	Строки.Колонки.Добавить("Brand");
	Строки.Колонки.Добавить("Comment");
	Строки.Колонки.Добавить("Count");
	Строки.Колонки.Добавить("Name");
	Строки.Колонки.Добавить("NumberInv");
	Строки.Колонки.Добавить("Price");
	Строки.Колонки.Добавить("Price_Zak");
	
КонецПроцедуры

Функция ПолучитьКонтрагентаПоEMail(АдресОтправителя, ЭтоВременныйКонтрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Контрагенты.ГоловнойКонтрагент
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.EMailЗаказ_АдресЭлПочты ПОДОБНО &АдресОтправителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.EMailЗаказ_АдресЭлПочты ПОДОБНО &АдресОтправителя";
	
	Запрос.УстановитьПараметр("АдресОтправителя", "%" + АдресОтправителя + "%");
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаПоГоловномуКонтрагенту = Результат[0].Выбрать();
	
	Если ВыборкаПоГоловномуКонтрагенту.Количество() > 1 Тогда  

		ТекстГоловныеКонтрагенты = "";
		
		Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
			ТекстГоловныеКонтрагенты = ТекстГоловныеКонтрагенты + ВыборкаПоГоловномуКонтрагенту.ГоловнойКонтрагент.Наименование + Символы.ПС;
		КонецЦикла;
		
		ТекстСообщения = "Для эл. почты " + АдресОтправителя + " филиал не может быть однозначно определен (найдено несколько филиалов с разными головными контрагентами):" 
		               + Символы.ПС + ТекстГоловныеКонтрагенты;   

		ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ВыборкаПоФилиалам = Результат[1].Выбрать();
	
	Если ВыборкаПоФилиалам.Следующий() Тогда
		
		ЭтоВременныйКонтрагент = ?(ВыборкаПоФилиалам.Количество()>1, Истина, Ложь);
		Возврат ВыборкаПоФилиалам.Контрагент;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#Если Клиент Тогда
Процедура ОбработатьПисьма() Экспорт
	
	Почта = Новый Почта;
	
	Попытка
		Почта.Подключиться(КонфигурацияOutlook);
	Исключение
		
		ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу через Outlook! ");
		Возврат;
		
	КонецПопытки;
	
	Сообщения = Почта.Выбрать(Истина,Ложь);
	
	Попытка
		
		Excel = Новый ComОбъект("Excel.Application");
		Books = Excel.WorkBooks;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Ошибка,,, "Не удается запустить MS Excel!");
		Возврат;
		
	КонецПопытки;
						
	Шапка = Новый Структура;
	Строки = Новый ТаблицаЗначений;
			
	КоличествоОбработанныхПисем = 0;
	
	Для каждого Сообщение Из Сообщения Цикл
		
		СформироватьСтруктуру(Шапка,Строки);
		
		АдресОтправителя = СтрЗаменить(СокрЛП(нрег(Сообщение.Отправитель)), "smtp:", "");
		ТемаПисьма = СокрЛП(Сообщение.Тема);
		
		ЭтоВременныйКонтрагент = Ложь;
		Контрагент = ПолучитьКонтрагентаПоEMail(АдресОтправителя, ЭтоВременныйКонтрагент);
		
		Если Контрагент <> Неопределено Тогда
			
			ГоловнойКонтрагент = ?(ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент), Контрагент.ГоловнойКонтрагент, Контрагент);
			
			Если Контрагент.EMailЗаказ_НомерПервойСтроки = 0 Или Контрагент.EMailЗаказ_СтруктураФайла.Количество() = 0 Тогда
				
				Сообщить("Для контрагента " + СокрЛП(Контрагент) + " не заполнены настройки для EMail-заказа (Номер первой строки Excel-файла, структура Eхcel-файла)");
				ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Ошибка,,, "Для контрагента " + СокрЛП(Контрагент) + " не заполнены настройки для EMail-заказа (Номер первой строки Excel-файла, структура Eхcel-файла)");
				Возврат;
				
			КонецЕсли;
			
			КонтрольнаяКолонка = 0;
			КолонкаКоличество = Константы.КоличествоКолонокEmailЗаказов.Получить();
			
			Для Каждого Стр Из Контрагент.EMailЗаказ_СтруктураФайла Цикл
				
				Если Стр.ПолеExcel = КолонкаКоличество Тогда
					
					КонтрольнаяКолонка = Стр.НомерКолонки;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если КонтрольнаяКолонка = 0 Тогда
				
				Сообщить("Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена структура Eхcel-файла");
				ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Ошибка,,, "Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена структура Eхcel-файла");
				Возврат;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Контрагент.EMailЗаказ_Договор) Тогда
				Договор = Контрагент.EMailЗаказ_Договор;
			Иначе 				
				Договор = ?(ЗначениеЗаполнено(ГоловнойКонтрагент.EMailЗаказ_Договор), ГоловнойКонтрагент.EMailЗаказ_Договор, ГоловнойКонтрагент.ОсновнойДоговорКонтрагента);
			КонецЕсли;

			Организация = Договор.Организация;
			Шапка.DogovorID = ПолучитьИДДоговораСПокупателем(Договор);
			Шапка.KlientID = ?(ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом 
			               ИЛИ Не ЗначениеЗаполнено(ГоловнойКонтрагент.IDАварда), ГоловнойКонтрагент.КодМДМ, ГоловнойКонтрагент.IDАварда);   
			Шапка.FilialID = ?(ЭтоВременныйКонтрагент, "", ?(Контрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом 
			               ИЛИ (НЕ ЗначениеЗаполнено(Контрагент.IDФилиала) И НЕ СокрЛП(Контрагент.IDФилиала) = "ОбъектXDTO" И СтрДлина(Контрагент.IDФилиала) < 8), 
						   Контрагент.КодМДМ, Контрагент.IDФилиала)); 
			
			Если Контрагент.СпособДоставки=Перечисления.СпособДоставки.НашаДоставка Тогда
				Шапка.TipDost = "4";
			ИначеЕсли Контрагент.СпособДоставки=Перечисления.СпособДоставки.Самовывоз Тогда
				Шапка.TipDost = "1";
			Иначе
				Шапка.TipDost = "9999";
			КонецЕсли;
			
			ПромНомерСклада = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
			
			Шапка.SkladID = ?(ПромНомерСклада = "", "1", ПромНомерСклада); //Собственный склад всегда	
			Шапка.Name = ГоловнойКонтрагент.Наименование;
			Шапка.INN = ГоловнойКонтрагент.ИНН;
			Шапка.KPP = ГоловнойКонтрагент.КПП;
			Шапка.OrderID = Прав(Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧРГ=0"), 9);
			Шапка.ИдентификаторСообщения = АдресОтправителя + " от " + СокрЛП(Сообщение.ДатаПолучения) + ?(ЗначениеЗаполнено(ТемаПисьма), " Тема: " + ТемаПисьма, "");
			Шапка.Контрагент = ГоловнойКонтрагент;
			Шапка.ФилиалКонтрагента = ?(ЭтоВременныйКонтрагент, Неопределено, Контрагент);
			Шапка.Dostavka = "";
			
			КоличествоОбработанныхФайлов = 0;
			
			Для каждого Вложение Из Сообщение.Вложения Цикл
				
				СимвРасширения = Найти(нрег(Вложение.Наименование), ".xls"); 
				
				Если СимвРасширения = 0 Тогда
					Продолжить;		//Вложение не Excel-файл
				КонецЕсли;
				
				Расширение = Сред(нрег(Вложение.Наименование),СимвРасширения);
				
				НомерСтроки = Контрагент.EMailЗаказ_НомерПервойСтроки;
				Файл = КаталогВременныхФайлов() + (Новый УникальныйИдентификатор()) + Расширение;
				Вложение.Данные.Записать(Файл);
			
				Book = Books.Open(Файл);
				Book.Activate();
				
				Page = Book.Sheets(1);
				Page.Activate();
				
				КоличествоОбработанныхФайлов = КоличествоОбработанныхФайлов + 1;
			
				Пока НЕ ПустаяСтрока(Excel.Cells(НомерСтроки, КонтрольнаяКолонка).Value) Цикл
					
					НовСтр = Строки.Добавить();
					НовСтр.Count = "0";
					НовСтр.Price = "0";
					НовСтр.Price_Zak = "0";
					
					Для Каждого Колонка Из Строки.Колонки Цикл
						
						ПолеExcelФайла = Контрагент.EMailЗаказ_СтруктураФайла.Найти(Справочники.EMailЗаказ_ПоляExcel.НайтиПоРеквизиту("НаименованиеWeb", Колонка.Имя));
						
						Если ПолеExcelФайла <> Неопределено и ПолеExcelФайла.НомерКолонки <> 0 
							и ЗначениеЗаполнено(СокрЛП(Excel.Cells(НомерСтроки, ПолеExcelФайла.НомерКолонки).Value)) Тогда
							НовСтр[Колонка.Имя] = СокрЛП(Excel.Cells(НомерСтроки, ПолеExcelФайла.НомерКолонки).Value);
						КонецЕсли;
					КонецЦикла;
					
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;	
				
				Book.Close(Ложь);
				
			КонецЦикла;
			
			Если Строки.Количество() > 0 Тогда
				
				НовыйЗаказ = Неопределено;
				Итог = МСКWEB.ПолучитьЗаказыСПортала(Шапка, Строки, Истина, НовыйЗаказ);
				
			ИначеЕсли КоличествоОбработанныхФайлов = 0 Тогда
				ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Предупреждение,,, "В письме контрагента " + СокрЛП(Контрагент) + " во вложении не обнаружены Excel-файлы)");
			Иначе
				ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Ошибка,,, "Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена таблица ""Структура Excel-файла""");
			КонецЕсли;
		
			Если ТипЗнч(НовыйЗаказ) = Тип("СправочникСсылка.НеСозданныеЗаказыПокупателей") Тогда
				Сообщить("Обнаружены ошибки. Заказ сохранен в справочнике Несозданные заказы");
			ИначеЕсли ТипЗнч(НовыйЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Сообщить("Создан документ "+Строка(НовыйЗаказ));
			Иначе
				Сообщить("Обнаружены ошибки. Подробная информация об ошибках в журнале регистрации");
			КонецЕсли;
				
			Попытка
				УдалитьФайлы(Файл);
			Исключение
			КонецПопытки;
			
			Сообщение.Непрочтено = ложь;
			
		КонецЕсли;
		
		КоличествоОбработанныхПисем = КоличествоОбработанныхПисем + 1;
		
	КонецЦикла;
	
	Сообщить("Обработано входящих непрочтенных писем: " + Строка(КоличествоОбработанныхПисем));
	
	Excel.Quit();
	
	//Почта.УдалитьСообщения(МассивОбработанныхСообщений);
	Почта.Отключиться();	
	
КонецПроцедуры
#КонецЕсли

функция СоздатьОповещениеОбОшибкеОтправкиВАварду(НаименованиеЗадачи, ОписаниеЗадачи, ОбъектЗадачи = Неопределено) Экспорт 
	
	СписокПользователейПочта = УправлениеПользователями.ВернутьСписокПользователейСУстановленнымПравом(ПланыВидовХарактеристик.ПраваПользователей.ПолучатьУведомленияПоПочтеСвязанныеСРегламентойЗагрузкойEMailЗаказов);
	
	Если СписокПользователейПочта.Количество() = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросАдресов = Новый Запрос;
	ЗапросАдресов.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление КАК АдресЭлПочты
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляУведомленийРегламентнойЗагрузкиEMailЗаказов)
	|	И КонтактнаяИнформация.Объект В(&СписокПользователй)";
	
	ЗапросАдресов.УстановитьПараметр("СписокПользователй", СписокПользователейПочта);
	РезультатАдресов = ЗапросАдресов.Выполнить();
	
	Если НЕ РезультатАдресов.Пустой() Тогда
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить(); 		
		
		Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			Возврат Истина;
		КонецЕсли; 		
		
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		Почта = Новый ИнтернетПочта; 
		
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			Возврат Истина;
		КонецПопытки;
		
		ВыборкаВдресов = РезультатАдресов.Выбрать();
		
		Пока ВыборкаВдресов.Следующий() Цикл
			
			ПромАдресОтправки = ВыборкаВдресов.АдресЭлПочты;			
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = НаименованиеЗадачи;
			Сообщение.Получатели.Добавить(ПромАдресОтправки); 
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Тексты.Добавить(ОписаниеЗадачи);
			
			Почта.Послать(Сообщение);			
			
		КонецЦикла;
		
		Почта.Отключиться();  
		
	КонецЕсли;	
	
	Возврат Истина;

КонецФункции

Функция ПолучитьИнтернетПочтовыйПрофильIMAP(УчетнаяЗапись)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = УчетнаяЗапись.SMTPСервер;
	
	Если УчетнаяЗапись.ВремяОжиданияСервера > 0 Тогда
		Профиль.ВремяОжидания = УчетнаяЗапись.ВремяОжиданияСервера;
	КонецЕсли; 
	
	Профиль.Пароль                 = УчетнаяЗапись.Пароль;
	Профиль.Пользователь           = УчетнаяЗапись.Логин;
	Профиль.ПортSMTP               = УчетнаяЗапись.ПортSMTP;	
	
	Если УчетнаяЗапись.ТребуетсяSMTPАутентификация Тогда
		
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		Профиль.ПарольSMTP         = УчетнаяЗапись.ПарольSMTP;
		Профиль.ПользовательSMTP   = УчетнаяЗапись.ЛогинSMTP;
		
	Иначе
		
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		Профиль.ПарольSMTP         = "";
		Профиль.ПользовательSMTP   = "";
		
	КонецЕсли; 
	
	Профиль.ИспользоватьSSLSMTP = УчетнаяЗапись.SSL_SMTP;
	Профиль.ИспользоватьSSLIMAP   = Истина;  
	Профиль.АдресСервераIMAP	  = УчетнаяЗапись.POP3Сервер;  
	Профиль.ПортIMAP			  = УчетнаяЗапись.ПортPOP3; 	
	Профиль.ПользовательIMAP	  = УчетнаяЗапись.Логин;
	Профиль.ПарольIMAP      	  = УчетнаяЗапись.Пароль;
	Профиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
	
	Возврат Профиль;

КонецФункции

Функция ПолучитьСписокКлиентовЕмайлЗаказов()
	
	ЗапросПочтыДляЗаказов = Новый Запрос;
	ЗапросПочтыДляЗаказов.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Контрагенты.EMailЗаказ_АдресЭлПочты КАК СТРОКА(100)) КАК АдресЭлПочты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.EMailЗаказ_АдресЭлПочты ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Контрагенты.EMailЗаказ_АдресЭлПочты КАК СТРОКА(100))";
	
	РезультатЗапросПочтыДляЗаказов = ЗапросПочтыДляЗаказов.Выполнить();
	
	Если НЕ РезультатЗапросПочтыДляЗаказов.Пустой() Тогда
		
		ВыборкаЗапросаПочтыДляЗаказов = РезультатЗапросПочтыДляЗаказов.Выбрать();
		ПромСтрокаАдресов = "";
		
		Пока ВыборкаЗапросаПочтыДляЗаказов.Следующий() Цикл
			ПромСтрокаАдресов = ПромСтрокаАдресов + ?(ЗначениеЗаполнено(ПромСтрокаАдресов), ";", "") + СокрЛП(ВыборкаЗапросаПочтыДляЗаказов.АдресЭлПочты);
		КонецЦикла;	
		
		Возврат ПромСтрокаАдресов;
	Иначе
		Возврат "";
	КонецЕсли;	

КонецФункции

Процедура РегалментноеВыполнение() Экспорт 
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.EmailЗаказы;
	Профиль = ПолучитьИнтернетПочтовыйПрофильIMAP(УчетнаяЗапись); 	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль,ПротоколИнтернетПочты.IMAP);
	Исключение		
		
		ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов",УровеньЖурналаРегистрации.Ошибка,,,
		"Не удалось подключиться к почтовому серверу ! " + СокрЛП(ОписаниеОшибки()) + "");   
		Возврат;
		
	КонецПопытки;
	
	СтрокаАдресовПолученияПисем = ПолучитьСписокКлиентовЕмайлЗаказов();
	
	Если Не ЗначениеЗаполнено(СтрокаАдресовПолученияПисем) Тогда
		
		ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Ошибка,,,
		"Отсутствуют клиенты с заполнеными адресами эл.почты для получения писем с заказами");
		Возврат; 		
		
	КонецЕсли;		
	
	МассивИД = Новый Массив;
	
	ПараметрыОтбораПисем = Новый Структура;
	ПараметрыОтбораПисем.Вставить("Прочитанные", Ложь);
	ПараметрыОтбораПисем.Вставить("ПослеДатыОтправления", НачалоДня(ТекущаяДата() - 7 * 86400)); 

	Заголовки = Почта.ПолучитьЗаголовки(ПараметрыОтбораПисем);
	
	Для Каждого СтрокаЗаголовков Из Заголовки Цикл
		
		ЭтоВременныйКонтрагент = Ложь;
		АдресОтправителя = СокрЛП(СтрокаЗаголовков.Отправитель.Адрес);		
		Контрагент = ПолучитьКонтрагентаПоEMail(АдресОтправителя, ЭтоВременныйКонтрагент);
		
		Если Контрагент <> Неопределено Тогда
			МассивИД.Добавить(СтрокаЗаголовков);			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если МассивИД.Количество() > 0 Тогда 
		
		Сообщения = Почта.Выбрать(Ложь, МассивИД, Ложь);
		
		Для Каждого Сообщение Из Сообщения Цикл
			
			Шапка  = Новый Структура;
			Строки = Новый ТаблицаЗначений;			
			СформироватьСтруктуру(Шапка, Строки); 
			
			ЭтоВременныйКонтрагент = Ложь;
			АдресОтправителя = СокрЛП(Сообщение.Отправитель.Адрес);	
			Контрагент = ПолучитьКонтрагентаПоEMail(АдресОтправителя, ЭтоВременныйКонтрагент);
			
			ГоловнойКонтрагент = ?(ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент), Контрагент.ГоловнойКонтрагент, Контрагент);
			
			Если Контрагент.EMailЗаказ_НомерПервойСтроки = 0 Или Контрагент.EMailЗаказ_СтруктураФайла.Количество() = 0 Тогда
				
				ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов",УровеньЖурналаРегистрации.Ошибка,,,
				"Для контрагента " + СокрЛП(Контрагент) + " не заполнены настройки для EMail-заказа (Номер первой строки Excel-файла, структура Eхcel-файла)");
				
				СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
				"Для контрагента " + СокрЛП(Контрагент) + " не заполнены настройки для EMail-заказа (Номер первой строки Excel-файла, структура Eхcel-файла)",);
				
				Продолжить;
				
			КонецЕсли;
			
			КонтрольнаяКолонка = 0;
			КолонкаКоличество = Константы.КоличествоКолонокEmailЗаказов.Получить();
			
			Для Каждого Стр Из Контрагент.EMailЗаказ_СтруктураФайла Цикл
				
				Если Стр.ПолеExcel = КолонкаКоличество Тогда
					
					КонтрольнаяКолонка = Стр.НомерКолонки;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если КонтрольнаяКолонка = 0 Тогда
				
				ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Ошибка,,,
				"Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена структура Eхcel-файла");
				
				СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
				"Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена структура Eхcel-файла",);
				
				Продолжить;
				
			КонецЕсли;
			
			КоличествоОбработанныхФайлов = 0;
			ОшибкаОтправлена = Ложь;
			
			Для Каждого Вложение Из Сообщение.Вложения Цикл
				
				СимвРасширения = Найти(нрег(Вложение.Имя), ".xls"); 
				
				Если СимвРасширения = 0 Тогда
					Продолжить;		//Вложение не Excel-файл
				КонецЕсли;
				
				Расширение = Сред(нрег(Вложение.Имя),СимвРасширения);
				Файл = КаталогВременныхФайлов() + (Новый УникальныйИдентификатор()) + Расширение;
				Вложение.Данные.Записать(Файл);
				
				ТабДок = Новый ТабличныйДокумент;
				
				Попытка
					ТабДок.Прочитать(Файл, СпособЧтенияЗначенийТабличногоДокумента.Значение);
				Исключение
					
					ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов",УровеньЖурналаРегистрации.Ошибка,,,
					"Не удалось прочитать вложенный файл от " + СокрЛП(Контрагент) + " в письме " + СокрЛП(Сообщение.Тема) + " от " + СокрЛП(Сообщение.ДатаОтправления));
					
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
					"Не удалось прочитать вложенный файл от " + СокрЛП(Контрагент) + " в письме " + СокрЛП(Сообщение.Тема) + " от " + СокрЛП(Сообщение.ДатаОтправления),);
					ОшибкаОтправлена = Истина;
					
					Продолжить;               					
					
				КонецПопытки;
				
				Если ТабДок.ВысотаТаблицы = 0 Тогда
					
					ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов",УровеньЖурналаРегистрации.Ошибка,,,
					"Во вложенном файле отсутствуют данные " + СокрЛП(Контрагент) + " в письме " + СокрЛП(Сообщение.Тема) + " от " + СокрЛП(Сообщение.ДатаОтправления));
					
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
					"Во вложенном файле отсутствуют данные " + СокрЛП(Контрагент) + " в письме " + СокрЛП(Сообщение.Тема) + " от " + СокрЛП(Сообщение.ДатаОтправления),);
					ОшибкаОтправлена = Истина;
					
					Продолжить; 
					
				КонецЕсли;	

				ТемаПисьма = СокрЛП(Сообщение.Тема);
				
				Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Контрагент.EMailЗаказ_Договор) Тогда
					Договор = Контрагент.EMailЗаказ_Договор;
				Иначе 				
					Договор = ?(ЗначениеЗаполнено(ГоловнойКонтрагент.EMailЗаказ_Договор), ГоловнойКонтрагент.EMailЗаказ_Договор, ГоловнойКонтрагент.ОсновнойДоговорКонтрагента);
				КонецЕсли;

				Организация = Договор.Организация;
				
				Шапка.DogovorID = ПолучитьИДДоговораСПокупателем(Договор);
				Шапка.KlientID = ?(ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом ИЛИ Не ЗначениеЗаполнено(ГоловнойКонтрагент.IDАварда), 
				                  ГоловнойКонтрагент.КодМДМ, ГоловнойКонтрагент.IDАварда);   
				Шапка.FilialID = ?(ЭтоВременныйКонтрагент, "", ?(Контрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом 
				                ИЛИ (НЕ ЗначениеЗаполнено(Контрагент.IDФилиала) И НЕ СокрЛП(Контрагент.IDФилиала) = "ОбъектXDTO" 
								И СтрДлина(Контрагент.IDФилиала) < 8), Контрагент.КодМДМ, Контрагент.IDФилиала)); 
				
				Если Контрагент.СпособДоставки=Перечисления.СпособДоставки.НашаДоставка Тогда
					Шапка.TipDost = "4";
				ИначеЕсли Контрагент.СпособДоставки=Перечисления.СпособДоставки.Самовывоз Тогда
					Шапка.TipDost = "1";
				Иначе
					Шапка.TipDost = "9999";
				КонецЕсли;
				
				ПромНомерСклада = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
				
				Шапка.SkladID = ?(ПромНомерСклада = "", "1", ПромНомерСклада); //Собственный склад всегда	
				Шапка.Name = ГоловнойКонтрагент.Наименование;
				Шапка.INN = ГоловнойКонтрагент.ИНН;
				Шапка.KPP = ГоловнойКонтрагент.КПП;
				Шапка.OrderID = Прав(Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(),"ЧРГ=0"),9);
				Шапка.ИдентификаторСообщения = АдресОтправителя + " от " + СокрЛП(Сообщение.ДатаОтправления) + ?(ЗначениеЗаполнено(ТемаПисьма), " Тема: " + ТемаПисьма, "");
				Шапка.Контрагент = ГоловнойКонтрагент;
				Шапка.ФилиалКонтрагента = ?(ЭтоВременныйКонтрагент, Неопределено, Контрагент);
				Шапка.Dostavka = ""; 				

				КоличествоОбработанныхФайлов = КоличествоОбработанныхФайлов + 1; 
				НомерСтроки = Контрагент.EMailЗаказ_НомерПервойСтроки;

				КолСтр = ТабДок.ВысотаТаблицы;
				
				Для Сч = НомерСтроки  ПО КолСтр Цикл
					
					Если НЕ ЗначениеЗаполнено(СокрЛП(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + КонтрольнаяКолонка).ТекущаяОбласть.Текст)) Тогда 
						Прервать;
					КонецЕсли;
					
					НовСтр = Строки.Добавить();
					НовСтр.Count = "0";
					НовСтр.Price = "0";
					НовСтр.Price_Zak = "0";					
					
					Для Каждого Колонка Из Строки.Колонки Цикл
						
						ПолеExcelФайла = Контрагент.EMailЗаказ_СтруктураФайла.Найти(Справочники.EMailЗаказ_ПоляExcel.НайтиПоРеквизиту("НаименованиеWeb", Колонка.Имя));
						
						Если ПолеExcelФайла <> Неопределено и ПолеExcelФайла.НомерКолонки <> 0 
							и ЗначениеЗаполнено(СокрЛП(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + ПолеExcelФайла.НомерКолонки).ТекущаяОбласть.Текст)) Тогда
							НовСтр[Колонка.Имя] = СокрЛП(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + ПолеExcelФайла.НомерКолонки).ТекущаяОбласть.Текст);
						КонецЕсли;
						
					КонецЦикла;					
					
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;	
				
			КонецЦикла;
			
			Если Строки.Количество() > 0 Тогда
				
				НовыйЗаказ = Неопределено;  
				
				//+Гавриленков В. 03.10.2024 #UT10-4810
				НачатьТранзакцию();  
				//-Гавриленков В. 03.10.2024 #UT10-4810
				
				Итог = МСКWEB.ПолучитьЗаказыСПортала(Шапка, Строки, Истина, НовыйЗаказ);
				
				Если Итог.OutForPortalLines[0].status = "0" Тогда 
					
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов",
					"Создан заказ № " + СокрЛП(НовыйЗаказ.Номер) + "для контрагента " +  СокрЛП(Контрагент) + " из письма " + СокрЛП(Сообщение.Тема) 
					+ " от " + СокрЛП(Сообщение.ДатаОтправления), НовыйЗаказ); 
					
				ИначеЕсли Итог.OutForPortalLines[0].status = "1" Тогда
					
					Если НЕ НовыйЗаказ = Неопределено Тогда
						СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (предупреждение)",
						"В справочнике несозданные заказы создана запись № " + СокрЛП(НовыйЗаказ.Код) + " для контрагента " + СокрЛП(Контрагент) 
						+ " из письма " + СокрЛП(Сообщение.Тема) + " от " + СокрЛП(Сообщение.ДатаОтправления), НовыйЗаказ);					
					КонецЕсли;
					
				ИначеЕсли Итог.OutForPortalLines[0].status = "3" Тогда
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
					"Произошла ошибка при создании заказа для контрагента " + СокрЛП(Контрагент) + " из письма " + СокрЛП(Сообщение.Тема) 
					+ " от " + СокрЛП(Сообщение.ДатаОтправления),);					
				КонецЕсли;				
				
				МассивДляФлагов = Новый Массив;
				МассивДляФлагов.Добавить(Сообщение);
				
				//+Гавриленков В. 03.10.2024 #UT10-4810
				Успешно = Истина;
				Попытка
					
					ФлагиСообщения = Почта.ПолучитьФлагиСообщений(МассивДляФлагов);
					ФлагиСообщения.Получить(СокрЛП(Сообщение.Идентификатор[0])).Прочитанное = Истина;
					Почта.УстановитьФлагиСообщений(ФлагиСообщения);	  
					
				Исключение  
					
					Успешно = Ложь;
					ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Информация,,, "Произошла ошибка при получении флага сообщения ");
					
				КонецПопытки; 
				
				
				Если Не Успешно Тогда
					
					ОтменитьТранзакцию(); 
					Прервать; 
					
				Иначе
					ЗафиксироватьТранзакцию();
				КонецЕсли;  
				//-Гавриленков В. 03.10.2024 #UT10-4810
				
			ИначеЕсли КоличествоОбработанныхФайлов = 0 Тогда
				
				Если НЕ ОшибкаОтправлена Тогда
					
					ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Предупреждение,,,
					"В письме контрагента " + СокрЛП(Контрагент) + " во вложении не обнаружены Excel-файлы)");
					
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
					"В письме контрагента " + СокрЛП(Контрагент) + " во вложении не обнаружены Excel-файлы)",); 
					
				КонецЕсли;
				
				МассивДляФлагов = Новый Массив;
				МассивДляФлагов.Добавить(Сообщение);
				
				ФлагиСообщения = Почта.ПолучитьФлагиСообщений(МассивДляФлагов);
				ФлагиСообщения.Получить(СокрЛП(Сообщение.Идентификатор[0])).Прочитанное = Истина;
				Почта.УстановитьФлагиСообщений(ФлагиСообщения);
				
			Иначе
				
				Если НЕ ОшибкаОтправлена Тогда
					
					ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов",УровеньЖурналаРегистрации.Ошибка,,,
					"Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена таблица ""Структура Excel-файла""");
					
					СоздатьОповещениеОбОшибкеОтправкиВАварду("Регламентная обработка EMail заказов (ошибка)",
					"Для контрагента " + СокрЛП(Контрагент) + " некорректно заполнена таблица ""Структура Excel-файла""",);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Попытка
				УдалитьФайлы(Файл);
			Исключение
			КонецПопытки; 			
			
		КонецЦикла;
		
	КонецЕсли;  
	
	Почта.Отключиться();

КонецПроцедуры
